# Data Science Salary Analysis

------------------------------


Research Questions and Work Breakdown:


- Setup and config - everyone
- Salary increase/decrease from 2020-2024 - Khadija
- How does the average salary vary by experience? - Maria
- What is the breakdown of senior/mid-level/entry level jobs? Does this say anything about the job market right now? - Riley, Khadija 
- What is the average salary for each job title? - Susan (Riley)
- Country totals for Data Science Jobs - Which country had the most data science jobs per capita? We can make calls to population statistics APIâ€™s to help with this. Could tell us which country has a more evolved service economy, particularly in the IT sphere.  - Riley
- Subquestions to the above question - breakdown by residence versus company location.
- API/census notebook? - Riley



======================================================

- Wich job title offers more jobs WFH vs on site
- What is the impact of company size?
- Does the size of the company correlate with the number of Data Science jobs

In [2]:
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import json
import time
from scipy.stats import linregress
from pathlib import Path

In [3]:
data_science_csv_file_path = Path("../resources/data_science_salaries.csv")

data_science_salaries_df = pd.read_csv(data_science_csv_file_path)

data_science_salaries_df.head()

,job_title,experience_level,employment_type,work_models,work_year,employee_residence,salary,salary_currency,salary_in_usd,company_location,company_size
0,Data Engineer,Mid-level,Full-time,Remote,2024,United States,148100,USD,148100,United States,Medium
1,Data Engineer,Mid-level,Full-time,Remote,2024,United States,98700,USD,98700,United States,Medium
2,Data Scientist,Senior-level,Full-time,Remote,2024,United States,140032,USD,140032,United States,Medium
3,Data Scientist,Senior-level,Full-time,Remote,2024,United States,100022,USD,100022,United States,Medium
4,BI Developer,Mid-level,Full-time,On-site,2024,United States,120000,USD,120000,United States,Medium

## Salary increase/decrease from 2020-2024

## Mean Salary Versus Exeperience

## Breakdown of Jobs by Experience

## Mean Salary Versus Job Title

## Which country had the most data science jobs per capita?

# Markdown cheatsheet (double click on the cell to see the different formatting commands)


## Big title



### Typical title



* bullet point
* blah blah blah



1. hello
2. this
3. is 
4. numbered


**hello**


*hello again*


> blockquote thing goes here


`code stuff`



```
{
    code stuff:
        but

    more complicated
}
```


~~strikethrough text here~~ 



### My Great Heading


term
: definition




Task List:

- [x] Write the press release
- [ ] Update the website
- [ ] Contact the media



Horizontal separator:

----------------------------------

Check the link below for more advanced/extended guides. 

[Link to markdown cheatsheet](https://www.markdownguide.org/cheat-sheet/)

[Link to another section in this notebook](#my-great-heading)



You can embed images as well by using ![some text](image_file_name)

Body text: Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.

In [4]:
#which country had the most data science jobs per capita
#re-init the data_science_salaries_df


data_science_salaries_df = pd.read_csv(data_science_csv_file_path)
data_science_salaries_df.head()

,job_title,experience_level,employment_type,work_models,work_year,employee_residence,salary,salary_currency,salary_in_usd,company_location,company_size
0,Data Engineer,Mid-level,Full-time,Remote,2024,United States,148100,USD,148100,United States,Medium
1,Data Engineer,Mid-level,Full-time,Remote,2024,United States,98700,USD,98700,United States,Medium
2,Data Scientist,Senior-level,Full-time,Remote,2024,United States,140032,USD,140032,United States,Medium
3,Data Scientist,Senior-level,Full-time,Remote,2024,United States,100022,USD,100022,United States,Medium
4,BI Developer,Mid-level,Full-time,On-site,2024,United States,120000,USD,120000,United States,Medium

In [8]:
#copying to a separate dataframe to prevent naming collisions, selecting columns as a subset

country_job_total_df = data_science_salaries_df.copy()
country_job_total_df = country_job_total_df[['employment_type', 'work_year', 'employee_residence', 'company_location', 'salary_in_usd']]
country_job_total_df.head()

,employment_type,work_year,employee_residence,company_location,salary_in_usd
0,Full-time,2024,United States,United States,148100
1,Full-time,2024,United States,United States,98700
2,Full-time,2024,United States,United States,140032
3,Full-time,2024,United States,United States,100022
4,Full-time,2024,United States,United States,120000

In [7]:
#

# country_job_total_df =

,employment_type,work_year,employee_residence,company_location,salary_in_usd
0,Full-time,2024,United States,United States,148100
1,Full-time,2024,United States,United States,98700
2,Full-time,2024,United States,United States,140032
3,Full-time,2024,United States,United States,100022
4,Full-time,2024,United States,United States,120000